In [3]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.446221 -1.719364
1    a  two -1.380323  0.728971
2    b  one -0.432988 -1.111187
3    b  two  1.469962  1.533956
4    a  one  0.251487 -0.312218

In [5]:
grouped=df['data1'].groupby(df['key1'])
grouped.min()

key1
a   -1.380323
b   -0.432988
Name: data1, dtype: float64

In [6]:
grouped.aggregate(['min','max'])

           min       max
key1
a    -1.380323  0.446221
b    -0.432988  1.469962

In [7]:
grouped.aggregate([('最小','min'),('最大','max')])

            最小        最大
key1
a    -1.380323  0.446221
b    -0.432988  1.469962

In [8]:
grouped =df.groupby('key1')['data1']
grouped.min()

key1
a   -1.380323
b   -0.432988
Name: data1, dtype: float64

In [9]:
grouped.aggregate([('最小','min'),('最大','max'),('數量','count')])

            最小        最大  數量
key1
a    -1.380323  0.446221   3
b    -0.432988  1.469962   2